# MultiSegmentGrid Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiSegmentGrid Class
Members See Also
---
This element acts as a multi-segmented Grid. The individual grids associated to the MultiSegmentGrid behave as a single unit and all share the same text. They inherit their type (GridType) from the MultiSegmentGrid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class MultiSegmentGrid : Element
```

Visual Basic
---
```text
Public Class MultiSegmentGrid _
	Inherits Element
```

Visual C++
---
```text
public ref class MultiSegmentGrid : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..MultiSegmentGrid
# See Also
MultiSegmentGrid Members
Autodesk.Revit.DB Namespace